In [1]:
import pandas as pd
import numpy as np

path = 'F:/DataEngineering/Resources/NYCTaxiCsv/taxi_trip_data.csv'

In [18]:
# Read data
dataFrame = pd.read_csv(path)

In [32]:
# Understanding the data
dataFrame.info()
dataFrame.head()
# TODO: - 'pickup_datetime' and 'dropoff_datetime' are object format. Needs to be converted to datetime format.
#       - 'payment_type' is object format. Needs to be converted to category format.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000000 entries, 0 to 9999999
Data columns (total 17 columns):
 #   Column               Dtype
---  ------               -----
 0   vendor_id            int64
 1   pickup_datetime      object
 2   dropoff_datetime     object
 3   passenger_count      int64
 4   trip_distance        float64
 5   rate_code            int64
 6   store_and_fwd_flag   object
 7   payment_type         int64
 8   fare_amount          float64
 9   extra                float64
 10  mta_tax              float64
 11  tip_amount           float64
 12  tolls_amount         float64
 13  imp_surcharge        float64
 14  total_amount         float64
 15  pickup_location_id   int64
 16  dropoff_location_id  int64
dtypes: float64(8), int64(6), object(3)
memory usage: 1.3+ GB

,vendor_id,pickup_datetime,dropoff_datetime,passenger_count,trip_distance,rate_code,store_and_fwd_flag,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,imp_surcharge,total_amount,pickup_location_id,dropoff_location_id
0,2,2018-03-29 13:37:13,2018-03-29 14:17:01,1,18.15,3,N,1,70.0,0.0,0.0,16.16,10.50,0.3,96.96,161,1
1,2,2018-03-29 13:37:18,2018-03-29 14:15:33,1,4.59,1,N,1,25.0,0.0,0.5,5.16,0.00,0.3,30.96,13,230
2,2,2018-03-29 13:26:57,2018-03-29 13:28:03,1,0.30,1,N,1,3.0,0.0,0.5,0.76,0.00,0.3,4.56,231,231
3,2,2018-03-29 13:07:48,2018-03-29 14:03:05,2,16.97,1,N,1,49.5,0.0,0.5,5.61,5.76,0.3,61.67,231,138
4,2,2018-03-29 14:19:11,2018-03-29 15:19:59,5,14.45,1,N,1,45.5,0.0,0.5,10.41,5.76,0.3,62.47,87,138

In [33]:
dataframe

NameError: name 'dataframe' is not defined